app/views/pages/profile.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "ndawg"]]
SELECT "posts".* FROM "posts" WHERE (user_id = 9)  ORDER BY "posts"."created_at" DESC
---
      <div class="col-sm-11">
        <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> <span class="post-creation">- <%= @p.created_at.to_formatted_s(:short) %></span></p>