app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "ndawg"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 9)  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def profile
   if (User.find_by_username(params[:id]))
    @username = params[:id]
  else
    redirect_to root_path, :notice=> "User not found!"
    end

  @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
  @newPost = Post.new

  @toFollow = User.all.last(5)

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5
---
  def explore
    @posts = Post.all
    @newPost = Post.new
        @toFollow = User.all.last(5)