app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if (@post.save)
---
INSERT INTO "posts" ("contect", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["contect", "Test"], ["user_id", 9], ["created_at", "2017-10-09 02:16:32.152777"], ["updated_at", "2017-10-09 02:16:32.152777"]]